import { StageData } from './types';

export const STAGES: StageData[] = [
  {
    id: 1,
    question: "တစ် နဲ့ တစ် ပေါင်းရင် ဘာရမလဲ သဲသဲ ?",
    answer: "ကိုကို့ အချစ်တွေ ရမယ်",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 2,
    question: "သိတာချင်းတူရင်တောင် တစ်ခုခုက ပိုသိနေတယ်။ အဲ့ဒါဘာလဲ?",
    answer: "ချစ်တာတစ်ခုတည်း သိတယ်",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 3,
    question: "သဲသဲ... တောင်တန်းကြီးကို ချစ်လား? သံလွင်မြစ်ကြီးကော? ဘယ်ဟာက ပိုလှလဲ?",
    answer: "နှစ်ခုစလုံးထက် သဲသဲက ပိုလှတယ်",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 4,
    question: "ကမ္ဘာမြေကြီးရဲ့ ဆွဲငင်အားက အကောင်းဆုံးလို့ ထင်လား?",
    answer: "မဟုတ်ဘူး... ကိုကို့အပေါ် သက်ရောက်မှုအရှိဆုံး ဆွဲငင်အားက သဲသဲ ပါ။",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 5,
    question: "ထာဝရ ဆိုတာ ဘယ်လောက်ကြာလဲ ဟင်?",
    answer: "ကိုကို့ ဘေးမှာ သဲသဲ ရှိနေပေးသရွေ့ ကာလပါပဲ။",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 6,
    question: "ကောင်းကင်က ကြယ်တွေနဲ့ သဲသဲ ဘာကွာလဲ သိလား?",
    answer: "ကြယ်တွေက ညဘက်မှ လင်းတာ... သဲသဲက ကိုကို့ နေ့ရက်တိုင်းကို လင်းစေတာ။",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 7,
    question: "ကမ္ဘာမှာ အရပ် ၈ မျက်နှာ ရှိတယ်တဲ့...",
    answer: "ကိုကို့ အတွက်တော့ ၁ မျက်နှာပဲ ရှိတယ်... အဲ့ဒါ သဲသဲရဲ့ မျက်နှာလေးပဲ။",
    buttonText: "အဖြေကြည့်မယ်"
  },
  {
    id: 8,
    question: "ကော်ဖီခါးခါးတွေ ဘာလို့ သောက်နိုင်လဲ သိလား?",
    answer: "သဲသဲ ရဲ့ အပြုံးလေးတွေက ကိုကို့အတွက် အချိုဓာတ်လွန်ကဲနေလို့လေ။",
    buttonText: "အဖြေကြည့်မယ်"
  }
];